[
    {
        "min": 2.1,
        "max": 2.9,
        "content_zh": "身寒骨冷苦伶仃，此命推来行乞人。劳劳碌碌无度日，终年打拱过平生。",
        "content_en": "Cold body and bones, bitter and lonely, This fate predicts a beggar's life. Toiling endlessly without respite, Bowing through life year after year.",
        "interpretation_zh": "此命主一生劳碌，财运不佳，宜脚踏实地，积德行善以改运。",
        "interpretation_en": "This fate indicates a life of hard work with limited financial success. It's advised to stay grounded and accumulate good deeds to improve fortune."
    },
    {
        "min": 3.0,
        "max": 3.9,
        "content_zh": "劳劳碌碌苦中求，东奔西走何日休。若使终身勤与俭，老来稍可免忧愁。",
        "content_en": "Toiling endlessly in bitter pursuit, East and west wandering with no rest. If lifelong diligence and thrift persist, Old age may bring some relief from sorrow.",
        "interpretation_zh": "早年辛苦，中年后渐入佳境，勤俭持家可保晚年安康。",
        "interpretation_en": "Early years will be difficult, with gradual improvement in middle age. Frugality and diligence can ensure peace in old age."
    },
    {
        "min": 4.0,
        "max": 4.9,
        "content_zh": "平生衣禄是绵长，件件心中自主张。前面风霜多受过，后来必定享安康。",
        "content_en": "Clothing and food will be sufficient through life, Every matter can be decided by yourself. Though early years bear many hardships, Later years will surely bring peace and comfort.",
        "interpretation_zh": "衣食无忧，自主性强，先苦后甜之命。",
        "interpretation_en": "Adequate clothing and food, strong independence, a fate that turns sweet after initial bitterness."
    },
    {
        "min": 5.0,
        "max": 5.9,
        "content_zh": "为名为利终日劳，中年福禄也多遭。老来是有财星照，不比前番目下高。",
        "content_en": "Toiling daily for fame and wealth, Middle age brings mixed blessings. Old age shines with financial stars, Surpassing all previous expectations.",
        "interpretation_zh": "中年起伏较大，晚年财运亨通，名利双收。",
        "interpretation_en": "Middle age has ups and downs, but old age brings financial prosperity and recognition."
    },
    {
        "min": 6.0,
        "max": 6.9,
        "content_zh": "一朝金榜快题名，显祖荣宗立大功。衣食定然原裕足，田园财帛更丰盈。",
        "content_en": "Success comes swiftly with golden honors, Bringing glory to ancestors through great achievements. Clothing and food are naturally abundant, With wealth from lands and treasures overflowing.",
        "interpretation_zh": "功名显达，光宗耀祖，一生富贵荣华。",
        "interpretation_en": "A life of scholarly honor and ancestral glory, filled with wealth and luxury."
    },
    {
        "min": 7.0,
        "max": 7.2,
        "content_zh": "此命推来福不轻，不须愁虑苦劳心。荣华富贵已天定，正笏垂绅拜紫宸。",
        "content_en": "This fate brings immeasurable blessings, No need for worry or toil. Glory and wealth are heaven-sent, With official honors in the imperial court.",
        "interpretation_zh": "大富大贵之命，无须劳碌，福禄天成。",
        "interpretation_en": "A predestined life of great wealth and honor, requiring little toil."
    },
    {
        "min": 3.2,
        "max": 3.2,
        "content_zh": "初年运蹇事难谋，渐有财源如水流。到得中年衣食旺，那时名利一齐收。",
        "content_en": "Early years face obstacles in all endeavors, Gradually wealth flows like water. By middle age, clothing and food flourish, Then fame and fortune arrive together.",
        "interpretation_zh": "早年不顺，中年后财运渐佳，名利双收。",
        "interpretation_en": "Early difficulties give way to prosperity in middle age, bringing both fame and wealth."
    },
    {
        "min": 3.5,
        "max": 3.5,
        "content_zh": "生平福量不周全，祖业根基觉少传。营事生涯宜守旧，时来衣食胜从前。",
        "content_en": "Life's blessings are not complete, Few inheritances from ancestral roots. Maintain traditional ways in business, When time comes, clothing and food surpass the past.",
        "interpretation_zh": "祖业薄弱，宜守成，时机到来可超越从前。",
        "interpretation_en": "With little inherited wealth, maintaining tradition brings eventual prosperity surpassing the past."
    },
    {
        "min": 4.2,
        "max": 4.2,
        "content_zh": "得宽怀处且宽怀，何用双眉皱不开。若使中年命运济，那时名利一齐来。",
        "content_en": "Be generous where you can be generous, Why knit your brows in constant worry? If middle age brings favorable fate, Then fame and fortune will arrive together.",
        "interpretation_zh": "心胸开阔，中年后运势转佳，名利双收。",
        "interpretation_en": "A broad-minded approach leads to fame and fortune arriving together in middle age."
    },
    {
        "min": 4.5,
        "max": 4.5,
        "content_zh": "名利推来竟若何，前番辛苦后奔波。命中难养男和女，骨肉扶持也不多。",
        "content_en": "What can be said of fame and fortune? Early toil followed by restless travel. Fate makes it hard to raise sons and daughters, Even blood relatives offer little support.",
        "interpretation_zh": "名利需奔波劳碌，子女缘薄，亲族助力少。",
        "interpretation_en": "Fame and fortune require much travel; few children and little family support in this fate."
    },
    {
        "min": 5.2,
        "max": 5.2,
        "content_zh": "一世亨通事事能，不须劳苦自然宁。宗族有光欣喜甚，家业丰盈自称心。",
        "content_en": "A lifetime of smooth success in all endeavors, Natural peace without toil. The clan shines with great joy, The family business prospers to heart's content.",
        "interpretation_zh": "一生顺遂，不劳而获，家业兴旺，光宗耀祖。",
        "interpretation_en": "A smooth life with effortless success, bringing prosperity to family business and honor to ancestors."
    },
    {
        "min": 5.5,
        "max": 5.5,
        "content_zh": "为利为名终日劳，中年福禄也多遭。老来是有财星照，不比前番目下高。",
        "content_en": "Toiling daily for profit and fame, Middle age brings mixed blessings. Old age shines with financial stars, Surpassing all previous expectations.",
        "interpretation_zh": "为名利奔波，中年有波折，晚年财运亨通。",
        "interpretation_en": "Daily toil for gain brings middle-age challenges but outstanding financial fortune in old age."
    },
    {
        "min": 6.2,
        "max": 6.2,
        "content_zh": "此命生来福不穷，读书必定显亲宗。紫衣金带为卿相，富贵荣华皆可同。",
        "content_en": "This fate brings endless blessings, Study surely honors the family. Purple robe and golden belt mark high office, Sharing in all wealth and glory.",
        "interpretation_zh": "福泽深厚，学业有成，官运亨通，富贵荣华。",
        "interpretation_en": "Abundant blessings include scholarly success leading to high office and shared wealth."
    },
    {
        "min": 6.5,
        "max": 6.5,
        "content_zh": "细推此命福不轻，富贵荣华孰与争。定国安邦人极品，威声显赫震寰瀛。",
        "content_en": "Careful analysis shows great blessings, Who can rival this wealth and glory? Stabilizing the nation, a peerless person, Resounding fame shakes land and sea.",
        "interpretation_zh": "大富大贵之命，位极人臣，名震天下。",
        "interpretation_en": "Exceptional wealth and status, reaching the highest offices with world-shaking fame."
    },
    {
        "min": 7.1,
        "max": 7.1,
        "content_zh": "此命推来天下隆，必定人间一主公。富贵荣华享不尽，庙堂龙虎会风云。",
        "content_en": "This fate elevates above all under heaven, Surely becoming a lord among men. Endless enjoyment of wealth and honor, Dragons and tigers meet in the court's whirlwind.",
        "interpretation_zh": "帝王将相之命，富贵至极，权倾天下。",
        "interpretation_en": "A ruler's destiny with supreme wealth and power, where mighty forces converge."
    },
    {
        "min": 7.2,
        "max": 7.2,
        "content_zh": "此命推来福无穷，诗书满腹看功成。丰衣足食多安稳，正是人间有福人。",
        "content_en": "This fate brings boundless blessings, Literary talents lead to success. Abundant clothing and food bring security, Truly a blessed person in this world.",
        "interpretation_zh": "福泽无边，才高八斗，生活富足，人间福星。",
        "interpretation_en": "Limitless blessings with literary brilliance, leading to comfortable life as one of earth's fortunate."
    }
]
